{"EGO0001": {"approaches": ["EAP0001", "EAP0002"], "name": "Expose", "description": "Reveal the presence of ongoing adversary operations.", "long_description": "Expose is about discovering previously undetected adversaries engaging in one of two behaviors. First, the adversary may be attempting to gain access to the networks. Second, the adversary may be currently operating on the networks. Both categories of adversary behavior contain vulnerabilities that can be advantageous for a defender seeking to expose the adversary. <br><br>\n\nAs an example of such a vulnerability, when an adversary interacts with network or system resources, they are vulnerable to trigger tripwires. The defender can make and leak fake credentials both inside and outside of the network. The defender can then monitor for the use of these credentials. Then, when an adversary uses a fake credential, the defender will receive a high-fidelity alert. In addition, if the credentials are unique, a defender may be able to detect how and when an adversary collected the credentials. Whenever a defender seeks to engage with an adversary, operational safety is paramount. To maintain this safety, it is a best practice to monitor adversaries as they operate in an engagement environment. Additionally, the defender must be able to observe the adversary. Therefore, collection and detection activities can often be utilized even when a defender may have other strategic goals in mind. <br><br>\n\nEngage defines two approaches to make progress towards the Expose goal.<ul><li>Collection allows the defender to capture and review data that the adversary produces during their operations. </li><li>Detection takes this collected data and turns it into an alert that the defender can use to their advantage.</li></ul> In many cases, the activities that support such Collection and Detection approaches are also good cybersecurity practices. However, in Engage, these activities will focus exclusively on the intersection of denial, deception, and adversary engagement technologies and the defender’s ability to Expose the adversary.", "type": "Engagement"}, "EGO0002": {"approaches": ["EAP0003", "EAP0004", "EAP0005"], "name": "Affect", "description": "Negatively impact the adversaries operations.", "long_description": "Affect is ultimately about changing the cost-value proposition in cyber operations for the adversary. The defender may want to increase the adversary’s cost to operate or drive down the value they derive from their operations. For example, the defender can negatively impact the adversary’s on-network operations to drive up the resource cost of doing operations by slowing down or selectively resetting connections to impact exfiltration. This type of activity increases the adversary’s time on target and wastes their resources. To drive down the value of stolen data, a defender could provide an adversary deliberately conflicting information. Providing such information requires an adversary to either choose to believe one piece of data over another, disregard both, collect more data, or continue with uncertainty. <br><br>\n\nAll these options increase operational costs and decrease the value of collected data. Engage defines three approaches to make progress towards the Affect goal.<ul><li>Prevent, focuses on setting up mitigations that stop some portion of an adversary’s operation’s from even starting.</li><li> Direct, attempts to maneuver an adversary into a better position for the defender.</li><li> Disrupt, seeks to cause problems in an adversary’s operations.</li></ul>", "type": "Engagement"}, "EGO0003": {"approaches": ["EAP0006", "EAP0007"], "name": "Elicit", "description": "Learn about adversaries tactics, techniques, and procedures.", "long_description": "Elicit encourages adversaries to reveal additional or more advanced TTPs and goals while operating in defender-controlled engagement environments. These high-fidelity, synthetic engagement environments are uniquely tailored to engage with specific adversaries. They may contain a combination of documents, browser artifacts, etc. to reassure an adversary and reduce suspicion. Further, they may offer enticing data and exploitable vulnerabilities to motivate an adversary to operate in the defender's environment. <br><br>\n\nThese environments can either be left as a dangle, i.e., honeypot. Other times, the defender may self-infect with malware. In either case, observing an adversary as they operate can provide organizations with actionable cyber threat intelligence and potential understanding of the adversary’s goals. <br><br>\n\nEngage defines two approaches to make progress towards the Elicit goal. <ul><li>Reassurance focuses on providing an environment that reduces adversary suspicion by meeting expectations and creating an artifact rich environment. </li><li> Motivation seeks to create a target rich environment that encourages the adversary to engage in new TTPs.</li></ul>", "type": "Engagement"}, "SGO0001": {"approaches": ["SAP0001"], "name": "Prepare", "description": "Help the defender think about what they want to accomplish with operations.", "long_description": "Prepare is used to ensure the defender drives progress during adversary engagement operations towards a desired end-state or Strategic Goal. To support this aim, the defender must first generate a clear picture of their organization and the threat landscape. This understanding should include their current security posture, including known strengths and weaknesses, and an inventory of priority cyber assets, including key intellectual property. The defender should then examine and update the threat models for any identified adversaries. <br><br>\n\nThese various assessments and models should enable the defender to identify their strategic goal. At this point, all activities should be aligned with this goal. Once a goal has been selected, the defender must work to plan for the operation by identifying a target adversary, creating the necessary Personas, generating an operational storyboard, etc. Finally, the key stakeholders should be called on to establish rules for operational safety and acceptable risk. At each step in the planning process, the defender should incorporate intelligence gained from previous operations to ensure that future operations can run more effectively and efficiently. <br><br> \n\nEngage defines a single approach to make progress towards the Prepare goal. <ul><li>Planning focuses collecting the various existing sources of intelligence together to inform the selection of a strategic goal and then to drive progress towards that goal.</li></ul> Unlike the Engagement Goals, Prepare has only a single approach. This laser focus is intentional for the first release of Engage. \n\n<br><br>Engage seeks to highlight that denial, deception, and adversary engagement activities cannot be viewed as \"fire and forget\". Unlike many defensive technologies, these activities must be viewed only in context of how they inform and drive progress towards larger strategic goals. To this end, Prepare is essential to ensure that every action taken in an engagement operation drives progress towards a unified goal.", "type": "Strategic"}, "SGO0002": {"approaches": ["SAP0002"], "name": "Understand", "description": "Make sure that the defender is capturing, utilizing, and refining knowledge learned to improve the defender's posture.  ", "long_description": "Understand frames how raw operational outputs can be collected, synthesized, and used to inform future operations and defensive strategies. The Understand goal helps the defender to assess their progress towards Strategic Goals. At its core, the Understand goal ensures that operational outputs can connect to and inform a larger strategy. To do this, the defender must turn the raw outputs from an operation into useful and actionable intelligence. These outputs may be in the form of collected PCAP, logs, qualitative defender observations, etc. Applying analytics to raw data can help the defender to map this data to adversary behavior. Now the behavior can be analyzed to contextualize the intelligence and inform the existing threat model. \n<br><br>\nFor example, the defender may look at raw PCAP data and identify a new IP address that the adversary uses for exfiltration. This IOC can be added to the existing threat model. After applying behavioral analytics to the data, the defender might see that the adversary used a new Defense Evasion technique. In that case, the defender should update the threat model to include this new intelligence. At this point, the defender should assess if this new intelligence will affect any ongoing operations. For example, the defender should ensure that current collection efforts will detect this new TTP. Other opportunities to increase the defender's understanding post-operation include efforts to refine and update individual engagement activities based on qualitative and quantitative outputs. The defender can reflect on how the overall engagement went and refine future activities to maximize the usefulness. \n<br><br>\nFinally, the defenders should assess their own coordination and communication. Teamwork is essential during an operation. The defender should seek to improve coordination and skills with each operation. Engage defines a single approach to make progress towards the Understand goal. <ul><li>Analysis, focuses on turning raw outputs into useful intelligence that drives future progress. </li></ul>Unlike the Engagement Goals, Understand has only a single approach. This laser focus is intentional for the first release of Engage. \n<br><br>\nEngage seeks to highlight that denial, deception, and adversary engagement activities cannot be viewed as \"\"fire and forget\"\". Unlike many defensive technologies, these activities must be viewed only in context of how they inform and drive progress towards larger strategic goals. To this end, Analysis is essential to turn the raw operational outputs into intelligence that drives progress towards these strategic goals.", "type": "Strategic"}}